directions_dict = {
    '01.03.02 Прикладная математика и информатика': '6552',
    "01.03.04 Прикладная математика": "6554",
    "01.04.02 Прикладная математика и информатика": "6632",
    "01.04.04 Прикладная математика": "6640",
    "02.03.02 Фундаментальная информатика и информационные технологии": "6551",
    "02.04.02 Фундаментальная информатика и информационные технологии": "6637",
    "09.03.02 Информационные системы и технологии": "6557",
    "09.03.03 Прикладная информатика": "6555",
    "09.04.02 Информационные системы и технологии": "6639",
    "09.04.03 Прикладная информатика": "6638",
    "10.03.01 Информационная безопасность": "6553",
    "10.04.01 Информационная безопасность": "8158",
    "38.03.05 Бизнес-информатика": "6559",
    "38.04.05 Бизнес-информатика": "6642",
}

pmi_dict = {
    "(Прикладная математика и информатика) очное 2024г.": "62892",
    "(Прикладная математика и информатика) очное 2023г.": "59631",
    "(Прикладная математика и информатика) очное 2022г.": "56033",
    "(Прикладная математика и информатика) очное 2021г.": "54449",
}

pm_dict = {
    "(Прикладная математика) очное 2024г.": "63517",
    "(Прикладная математика) очное 2023г.": "59778",
    "(Прикладная математика) очное 2022г.": "56305",
    "(Прикладная математика) очное 2021г.": "54472",
}

mpmi_dict = {
    "(Анализ данных и его приложения) очное 2024г.": "63516",
    "(Математические методы и информационные технологии в экономике и финансах) очное 2024г.": "62831",
    "(Искусственный интеллект и суперкомпьютерные вычисления) очное 2024г.": "62832",
    "(Математическое моделирование физических процессов) очное 2024г.": "63602",
    "(Математические методы и информационные технологии в экономике и финансах) очное 2023г.": "59257",
    "(Математическое моделирование физических процессов) очное 2023г.": "59254",
    "(Анализ данных и его приложения) очное 2023г.": "59261",
    "(Искусственный интеллект и суперкомпьютерные вычисления) очное 2023г.": "59251",

}

mpm_dict = {
    "(Вычислительная геометрия и высокопроизводительные вычисления) очное 2024г.": "62834",
    "(Методы математического моделирования) очное 2024г.": "62891",
    "(Классические и квантовые методы обработки информации) очное 2024г.": "62851",
    "(Вычислительная геометрия и высокопроизводительные вычисления) очное 2023г.": "59312",
    "(Методы математического моделирования) очное 2023г.": "59252",
    "(Классические и квантовые методы обработки информации) очное 2023г.": "59262",
}

fiit_dict = {
    "(Фундаментальная информатика и информационные технологии) очное 2024г.": "62871",
    "(Фундаментальная информатика и информационные технологии) очное 2023г.": "59776",
    "(Фундаментальная информатика и информационные технологии) очное 2022г.": "56035",
    "(Системный анализ и информационные технологии) очное 2021г.": "54499",
}

mfiit_dict = {
    "(Машинное обучение и компьютерное зрение) очное 2024г.": "62140",
    "(Математические основы и программное обеспечение информационной безопасности и защиты информации) очное 2024г.": "62141",
    "(Машинное обучение и компьютерное зрение) очное 2023г.": "59258",
    "(Математические основы и программное обеспечение информационной безопасности и защиты информации) очное 2023г.": "59260",
}

ist_dict = {
    "(Информационные системы и технологии) очное 2024г.": "62872",
    "(Информационные системы и технологии) очное 2023г.": "59751",
    "(Информационные системы и технологии) очное 2022г.": "56304",
    "(Информационные системы и технологии) очное 2021г.": "54481",
}

pi_dict = {
    "(Прикладная информатика) очное 2024г.": "63496",
    "(Прикладная информатика) очное 2023г.": "59775",
    "(Прикладная информатика) очное 2022г.": "56297",
    "(Прикладная информатика) очное 2021г.": "54501",
}

mist_dict = {
    "(Технологии разработки информационных систем) очное 2024г.": "62139",
    "(Технологии разработки информационных систем) очное 2023г.": "59264",
}

mpi_dict = {
    "(Информационная безопасность экономических систем) очное 2024г.": "62705",
    "(Информационная безопасность экономических систем) очное 2023г.": "59255",

}

ib_dict = {
    "(Безопасность компьютерных систем) очное 2024г.": "63495",
    "(Безопасность компьютерных систем) очное 2023г.": "59811",
    "(Безопасность компьютерных систем) очное 2022г.": "56037",
    "(Безопасность компьютерных систем) очное 2021г.": "54500",

}

mib_dict = {
    "(Математические методы и программные технологии защиты информации) очное 2024г.": "63494",
    "(Инфокоммуникации в специальной робототехнике) очное 2023г.": "59253",
    "(Математические методы и программные технологии защиты информации) очное 2023г.": "59256",
}

bi_dict = {
    "(Бизнес-информатика) очное 2024г.": "62873",
    "(Бизнес-информатика) очное 2023г.": "59752",
    "(Бизнес-информатика) очное 2022г.": "56032",
    "(Бизнес-информатика) очное 2021г.": "54796",
}

mbi_dict = {
    "(Цифровые технологии в бизнесе) очное 2024г.": "63493",
    "(Цифровые технологии в бизнесе) очное 2023г.": "59263",
}

params_list = [
    '62892', '59631', '56033', '54449',
    '63517', '59778', '56305', '54472',
    '63516', '62831', '62832', '63602',
    '59257', '59254', '59261', '59251',
    '62834', '62891', '62851', '59312',
    '59252', '59262', '62871', '59776',
    '56035', '54499', '62140', '62141',
    '59258', '59260', '62872', '59751',
    '56304', '54481', '63496', '59775',
    '56297', '54501', '62139', '59264',
    '62705', '59255', '63495', '59811',
    '56037', '54500', '63494', '59253',
    '59256', '62873', '59752', '56032',
    '54796', '63493', '59263'
]

params_dict = {
    '01.03.02 Прикладная математика и информатика': pmi_dict,
    "01.03.04 Прикладная математика": pm_dict,
    "01.04.02 Прикладная математика и информатика": mpmi_dict,
    "01.04.04 Прикладная математика": mpm_dict,
    "02.03.02 Фундаментальная информатика и информационные технологии": fiit_dict,
    "02.04.02 Фундаментальная информатика и информационные технологии": mfiit_dict,
    "09.03.02 Информационные системы и технологии": ist_dict,
    "09.03.03 Прикладная информатика": pi_dict,
    "09.04.02 Информационные системы и технологии": mist_dict,
    "09.04.03 Прикладная информатика": mpi_dict,
    "10.03.01 Информационная безопасность": ib_dict,
    "10.04.01 Информационная безопасность": mib_dict,
    "38.03.05 Бизнес-информатика": bi_dict,
    "38.04.05 Бизнес-информатика": mbi_dict,
}

names_dict = {
    '01.03.02 Прикладная математика и информатика': 1,
    "01.03.04 Прикладная математика": 1,
    "01.04.02 Прикладная математика и информатика": 0,
    "01.04.04 Прикладная математика": 0,
    "02.03.02 Фундаментальная информатика и информационные технологии": 1,
    "02.04.02 Фундаментальная информатика и информационные технологии": 0,
    "09.03.02 Информационные системы и технологии": 1,
    "09.03.03 Прикладная информатика": 1,
    "09.04.02 Информационные системы и технологии": 0,
    "09.04.03 Прикладная информатика": 0,
    "10.03.01 Информационная безопасность": 1,
    "10.04.01 Информационная безопасность": 0,
    "38.03.05 Бизнес-информатика": 1,
    "38.04.05 Бизнес-информатика": 0,
}

